Revit 2024 API
Transform1D.Scale Property
 The real number that represents the scale of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public double Scale { get; set; }
Visual Basic
Public Property Scale As Double
	Get
	Set
Visual C++
public:
property double Scale {
	double get ();
	void set (double value);
}
See Also
Transform1D Class
Autodesk.Revit.DB Namespace